In [1]:
import sqlite3
import pandas as pd

In [10]:
db=sqlite3.connect("IMDB.sqlite")
db

In [5]:
data=pd.read_sql_query('Select * from Student',db)
data

   rollnumber     name  age
0         101  prasant   21
1         102   snehal   22
2         103   sanjay   20
3         104     jitu   21
4         105    sandy   23
5         107   sanjay   20
6         108     jitu   21
7         109    sandy   23

In [6]:
data['age']==21 # give the boolean value

0     True
1    False
2    False
3     True
4    False
5    False
6     True
7    False
Name: age, dtype: bool

In [7]:
data[data['age']==21] # the true value is shows

   rollnumber     name  age
0         101  prasant   21
3         104     jitu   21
6         108     jitu   21

## how to create dataframe using pandas

In [8]:
data=pd.DataFrame([[201,'aman','english',2000],[202,'prasant','science',39999]],
                  columns=['id','name','course','salary'])
data

    id     name   course  salary
0  201     aman  english    2000
1  202  prasant  science   39999

# convert dataframe to table

In [11]:
data.to_sql("Faculty",db) # name of table data base connection object

OperationalError: database is locked

In [13]:
data=pd.read_sql_query('Select * from Student',db)
data["address"]='test' #adding a column in data frame
data

   rollnumber     name  age address
0         101  prasant   21    test
1         102   snehal   22    test
2         103   sanjay   20    test
3         104     jitu   21    test
4         105    sandy   23    test
5         107   sanjay   20    test
6         108     jitu   21    test
7         109    sandy   23    test

In [15]:
data.to_sql("Student",db,if_exists='replace')

DatabaseError: Execution failed on sql 'DROP TABLE "Student"': database is locked